[
    {
        "name": "White Palace Hotel",
        "rating": 4.2,
        "location": "House no: 25, Road-06, Sector-09, Dhaka, House 25 Road No. 6, Uttara, Dhaka, Dhaka Division, 1230, Bangladesh",
        "latitude": 23.879744,
        "longitude": 90.39683,
        "room_type": "Located in Dhaka, White Palace Hotel is within a 15-minute drive of International Convention City Bashundhara and Jamuna Future Park. This hotel is 7.3 mi (11.7 km) from Bangladesh National Zoo and 7.5 mi (12.1 km) from Sher-e-Bangla Cricket Stadium.\r\nPamper yourself with onsite massages or enjoy recreation amenities such as a 24-hour fitness center. This hotel also features complimentary wireless internet access, a television in a common area, and a banquet hall.\r\nEnjoy a meal at the restaurant or snacks in the coffee shop/cafe. The hotel also offers 24-hour room service.\r\nFeatured amenities include a 24-hour business center, express check-in, and express check-out. A roundtrip airport shuttle is provided for a surcharge (available 24 hours), and free self parking is available onsite.\r\nMake yourself at home in one of the 45 individually decorated guestrooms, featuring minibars and LED televisions. Complimentary wireless internet access keeps you connected, and cable programming is available for your entertainment. Private bathrooms have complimentary toiletries and hair dryers. Conveniences include safes and desks, as well as phones with free local calls.",
        "price": 24,
        "image_url": "/0581612000d3euoz5C29D.jpg"
    },
    {
        "name": "Hotel Afford Inn",
        "rating": 3.9,
        "location": "House 04 Road-03, Uttara, Dhaka, Dhaka Division, 1230, Bangladesh",
        "latitude": 23.85611,
        "longitude": 90.403093,
        "room_type": "Welcome to Hotel Afford Inn, your ideal airport hotel offering unparalleled convenience and comfort. Situated just a 5-minute drive from Hazrat Shahjalal International Airport and Dhaka Airport Railway Station, our prime location also places you near key transit points like the Elevated Expressway station and Dhaka Metro Station, just 15 minutes away. For event attendees, International Convention City Bashundhara (ICCB) is only a 10-minute drive, while the Bangladesh-China Friendship Exhibition Center (BCFEC) is 20 minutes away. Guests can start their day with a complimentary buffet breakfast, served daily from 6:30 AM to 10:30 AM. Additional amenities include a 24-hour business center, complimentary newspapers in the lobby, dry cleaning and laundry services, a 24-hour round-trip airport shuttle (available for a surcharge), and free self-parking onsite.  \n\nFor dining, visit Afford Dine, our in-house restaurant specializing in international cuisine, or enjoy casual options at the coffee shop/café. For added convenience, 24-hour room service is available. Our 50 individually furnished guestrooms are designed with comfort in mind, featuring refrigerators, microwaves, LCD TVs with cable programming, and complimentary Wi-Fi to keep you connected. Bathrooms are equipped with bathtubs or showers, complimentary toiletries, and hair dryers. Additional conveniences include safes, desks, and daily housekeeping. At Hotel Afford Inn, we combine exceptional location with thoughtful amenities to ensure a seamless and enjoyable stay.",
        "price": 25,
        "image_url": "/0221y120009uosuq43515.jpg"
    },
    {
        "name": "The Westin Dhaka",
        "rating": 4.5,
        "location": "Main Gulshan Avenue, Plot-01 Rd 45, Gulshan, Dhaka, Dhaka Division, 1212, Bangladesh",
        "latitude": 23.793288,
        "longitude": 90.414718,
        "room_type": "Discover Dhaka, Bangladesh, from the Westin Dhaka. Located in Gulshan 2, Dhaka's dynamic business and diplomatic district, our luxury Gulshan, Dhaka, hotel places you close to Farmgate, Banani, corporate offices, the U.S. Embassy, shopping, dining, entertainment, and historical landmarks. Recharge in your spacious luxury hotel room or suite where you'll find pampering touches, high-speed Wi-Fi, a mini-refrigerator, room service available 24 hours a day, a supremely comfortable Westin Heavenly Bed, and skyline views. Our five restaurants and bars offer an array of tempting international choices from fine Italian to a Pan Asian buffet. Relax in our outdoor heated pool, work out in our gym, or rejuvenate at our spa. If a business meeting, social event or wedding brings you to our hotel in Gulshan 2, Dhaka, you'll be delighted with our custom catering, exceptional service, and versatile indoor and outdoor venues. Whether traveling for work or play, we look forward to welcoming you to the Westin Dhaka soon.",
        "price": 134,
        "image_url": "/220w0z000000mxlzdF2B5.jpg"
    },
    {
        "name": "Grand Vistana",
        "rating": 4.6,
        "location": "Uttara Model Town | Sector: 1 | House: 11 | Road: 06 |, Uttara, Dhaka, Dhaka Division, 1230, Bangladesh",
        "latitude": 23.856941,
        "longitude": 90.401835,
        "room_type": "A stay at Grand Vistana places you in the heart of Dhaka, within a 10-minute drive of International Convention City Bashundhara and Jamuna Future Park. This hotel is 6.2 mi (9.9 km) from Baridhara Park and 7.2 mi (11.7 km) from Sher-e-Bangla Cricket Stadium.\r\nTake advantage of recreation opportunities such as a 24-hour fitness center, or other amenities including complimentary wireless internet access and concierge services. Additional features at this hotel include wedding services and a ballroom. If you'd like to spend the day shopping, you can hop on the shuttle (surcharge).\r\nEnjoy a meal at the restaurant, or stay in and take advantage of the hotel's 24-hour room service. A complimentary buffet breakfast is served daily from 6:00 AM to 10:30 AM.\r\nFeatured amenities include a business center, a 24-hour front desk, and luggage storage. Planning an event in Dhaka? This hotel has 380 square feet (35 square meters) of space consisting of a conference center and meeting rooms. A shuttle from the airport to the hotel is complimentary (available 24 hours), and a train station pick-up service is also provided at no charge.\r\nMake yourself at home in one of the 42 air-conditioned rooms featuring minibars. Your pillowtop bed comes with premium bedding. Complimentary wireless internet access is available to keep you connected. Private bathrooms with showers feature rainfall showerheads and complimentary toiletries.",
        "price": 29,
        "image_url": "/1mc5z12000gjtddur706C.jpg"
    },
    {
        "name": "Crowne Plaza Dhaka Gulshan",
        "rating": 4.7,
        "location": "6A Madani Ave, Gulshan, Dhaka, Dhaka Division, 1212, Bangladesh",
        "latitude": 23.79459,
        "longitude": 90.41395,
        "room_type": "Welcome to Crowne Plaza Dhaka Gulshan! We are a prominent hotel brand in IHG, known for our family-friendly environment and extensive loyalty program, IHG One Rewards. Located just 8.9 km from Hazrat Shahjalal International Airport, our hotel provides easy access to business districts, premium shopping, and dining options.During your stay, enjoy our modern amenities, comfortable bedding, and pillow choices in our premium accommodations. Indulge in culinary delights at our diverse dining establishments. Flair offers a wide selection of dishes at our all-day buffet restaurant, while Deli serves freshly brewed coffee and delightful pastries. For an exceptional dining experience, visit The Beast, our fine dining restaurant on the 26th floor, or try the unique flavors of our seasonal BBQ restaurant, Panache.Enjoy 24/7 access to our well-equipped gym, along with convenient services like in-house laundry, a self-service Business Centre, and round-the-clock room service.If you're planning an event, our modern function rooms feature state-of-the-art audio-visual equipment, perfect for meetings, receptions, or wedding dinners. Our dedicated banquets team will customize our facilities to meet your specific needs.We can't wait to welcome you to Crowne Plaza Dhaka Gulshan and provide you with true hospitality.",
        "price": 87,
        "image_url": "/0585812000cvq1sip15F9.jpg"
    },
    {
        "name": "Dhaka Regency Hotel & Resort Limited",
        "rating": 3.8,
        "location": "Airport Rd, Dhaka, Dhaka Division, 1229, Bangladesh",
        "latitude": 23.829347,
        "longitude": 90.419461,
        "room_type": "Located in Dhaka, Dhaka Regency Hotel & Resort is connected to the convention center, a 1-minute drive from Rajuk Trade Center Shopping Mall and 6 minutes from Jamuna Future Park. This family-friendly hotel is 3.3 mi (5.3 km) from Kurmitola General Hospital and 3.4 mi (5.5 km) from Army Golf Club.\r\nRelax at the full-service spa, where you can enjoy massages, body treatments, and facials. You're sure to appreciate the recreational amenities, including a health club, an outdoor pool, and a sauna. Additional amenities at this hotel include complimentary wireless internet access, concierge services, and free babysitting.\r\nEnjoy international cuisine at Grandiose Restaurant, a restaurant which features a bar/lounge, or stay in and take advantage of the 24-hour room service. Wrap up your day with a drink at the poolside bar. Buffet breakfasts are available daily from 6:30 AM to 10:30 AM for a fee.\r\nFeatured amenities include a 24-hour business center, limo/town car service, and complimentary newspapers in the lobby. A roundtrip airport shuttle is provided for a surcharge (available 24 hours), and free valet parking is available onsite.\r\nMake yourself at home in one of the 220 air-conditioned rooms featuring minibars and LED televisions. Complimentary wireless internet access keeps you connected, and satellite programming is available for your entertainment. Private bathrooms with shower/tub combinations feature complimentary toiletries and hair dryers. Conveniences include phones, as well as safes and desks.",
        "price": 62,
        "image_url": "/0581j12000cs51an0887C.jpg"
    },
    {
        "name": "Blossom Hotel Dhaka",
        "rating": 4.1,
        "location": "House# 5, Road# 1/A, Block# J, Baridhara, US Embassy Rd, Baridhara, Dhaka, Dhaka Division, 1212, Bangladesh",
        "latitude": 23.797509,
        "longitude": 90.425268,
        "room_type": "When you stay at Blossom Hotel Dhaka in Dhaka, you'll be connected to the convention center, within a 10-minute walk of Embassy of the United States of America and Embassy of Thailand. This hotel is 0.7 mi (1.2 km) from Embassy of Turkey and 0.8 mi (1.2 km) from Embassy of South Korea.\r\nEnjoy recreation amenities such as a 24-hour health club or take in the view from a rooftop terrace. Additional features at this hotel include complimentary wireless internet access, concierge services, and barbecue grills.\r\nEnjoy a meal at the restaurant, or stay in and take advantage of the hotel's 24-hour room service. Mingle with other guests at the complimentary reception, held daily. A complimentary local cuisine breakfast is served daily from 6:30 AM to 10:30 AM.\r\nFeatured amenities include a 24-hour business center, express check-in, and express check-out. A shuttle from the airport to the hotel is provided for a surcharge (available 24 hours), and free self parking is available onsite.\r\nMake yourself at home in one of the 35 air-conditioned rooms featuring fireplaces and plasma televisions. Your bed comes with down comforters and premium bedding. Complimentary wireless internet access keeps you connected, and cable programming is available for your entertainment. Conveniences include laptop-compatible safes and desks, and housekeeping is provided daily.",
        "price": 14,
        "image_url": "/0584p12000dwzcihz8DCE.jpg"
    },
    {
        "name": "Best Western Plus Maple Leaf",
        "rating": 4.3,
        "location": "Maple Leaf Hotel, Plot 1B, Rd No 1, Uttara, Dhaka, Dhaka Division, 1230, Bangladesh",
        "latitude": 23.855243,
        "longitude": 90.404097,
        "room_type": "A stay at Best Western Plus Maple Leaf places you in the heart of Dhaka, within a 10-minute drive of Jamuna Future Park and Bangladesh Army Stadium. This luxury hotel is 7.3 mi (11.7 km) from Gulshan Circle 1 and 8.8 mi (14.2 km) from Sher-e-Bangla Cricket Stadium.\r\nRelax at the full-service spa, where you can enjoy massages, body treatments, and facials. You can take advantage of recreational amenities such as a sauna and a fitness center. This hotel also features complimentary wireless internet access, concierge services, and a banquet hall.\r\nEnjoy Fusion cuisine at Tarragon, one of the hotel's 2 restaurants, or stay in and take advantage of the 24-hour room service. Snacks are also available at the coffee shop/cafe. Wrap up your day with a drink at the bar/lounge. Buffet breakfasts are available daily from 6:00 AM to 10:30 AM for a fee.\r\nFeatured amenities include complimentary wired internet access, a 24-hour business center, and express check-in. A roundtrip airport shuttle is provided for a surcharge (available 24 hours), and free self parking is available onsite.\r\nMake yourself at home in one of the 50 air-conditioned rooms featuring minibars and flat-screen televisions. Complimentary wired and wireless internet access keeps you connected, and cable programming provides entertainment. Private bathrooms with showers feature rainfall showerheads and complimentary toiletries. Conveniences include phones, as well as safes and desks.",
        "price": 79,
        "image_url": "/200k0s000000i31cdA937.jpg"
    },
    {
        "name": "Hotel Grand Circle Inn",
        "rating": 4,
        "location": "12 Outer Circular Rd, Motijheel, Dhaka, Dhaka Division, 1217, Bangladesh",
        "latitude": 23.741173,
        "longitude": 90.418581,
        "room_type": "Located in Dhaka, Hotel Ashrafee is within a 5-minute drive of Baitul Mukarram and St. Mary's Cathedral. This hotel is 1.1 mi (1.9 km) from Baily Road and 1.4 mi (2.3 km) from Ramna Park.\r\nTake in the views from a terrace and make use of amenities such as complimentary wireless internet access and concierge services.\r\nSatisfy your appetite for lunch or dinner at Aahelee, a restaurant which specializes in international cuisine, or stay in and take advantage of the 24-hour room service.\r\nFeatured amenities include complimentary newspapers in the lobby, dry cleaning/laundry services, and a 24-hour front desk. Free self parking is available onsite.\r\nStay in one of 30 guestrooms featuring LED televisions. Your pillowtop bed comes with down comforters and Egyptian cotton sheets. Complimentary wireless internet access keeps you connected, and cable programming is available for your entertainment. Bathrooms have deep soaking bathtubs and rainfall showerheads.",
        "price": 17,
        "image_url": "/0220k12000ab794b48AEC.jpg"
    },
    {
        "name": "Pan Pacific Sonargaon Dhaka",
        "rating": 4.3,
        "location": "107 Kazi Nazrul Islam Ave, Ramna, Dhaka, Dhaka Division, 1215, Bangladesh",
        "latitude": 23.749489,
        "longitude": 90.394466,
        "room_type": "With a stay at Pan Pacific Sonargaon Dhaka, you'll be centrally located in Dhaka, a 4-minute walk from Bashundhara City Mall and a 2-minute drive from University of Dhaka. This 5-star hotel is 1.3 mi (2 km) from Bangladesh National Museum and 1.4 mi (2.3 km) from Square Hospital Limited.\r\nPamper yourself with a visit to the spa, which offers massages, body treatments, and facials. You can take advantage of recreational amenities such as a health club, an outdoor pool, and a spa tub. This hotel also features complimentary wireless Internet access, concierge services, and gift shops/newsstands.\r\nGrab a bite at Jharna Grill, one of the hotel's 2 restaurants, or stay in and take advantage of the 24-hour room service. Snacks are also available at the 3 coffee shops/cafes. Wrap up your day with a drink at the bar/lounge. Buffet breakfasts are available daily from 6:30 AM to 10:00 AM for a fee.\r\nFeatured amenities include complimentary wired Internet access, a business center, and limo/town car service. A roundtrip airport shuttle is provided for a surcharge (available 24 hours), and free valet parking is available onsite.\r\nMake yourself at home in one of the 277 air-conditioned rooms featuring plasma televisions. Complimentary wired and wireless Internet access keeps you connected, and cable programming provides entertainment. Private bathrooms with shower/tub combinations feature complimentary toiletries and hair dryers. Conveniences include phones, as well as safes and desks.",
        "price": 104,
        "image_url": "/02271120009h92ygsEDDE.jpg"
    }
]